In [1]:
import pandas as pd

In [2]:
data = {'salesperson': ['Alice','Alice','Bob','Alice','Charlie','Bob','Charlie'],
       'item': ['car','trunk','car','car','car','car','trunk']}
df = pd.DataFrame(data)

In [3]:
df

  salesperson   item
0       Alice    car
1       Alice  trunk
2         Bob    car
3       Alice    car
4     Charlie    car
5         Bob    car
6     Charlie  trunk

In [4]:
df['count_by_person'] = df.groupby('salesperson').cumcount() + 1 
df['count_by_item'] = df.groupby('item').cumcount() + 1 
df['count_by_both'] = df.groupby(['salesperson','item']).cumcount() + 1

In [5]:
df

  salesperson   item  count_by_person  count_by_item  count_by_both
0       Alice    car                1              1              1
1       Alice  trunk                2              1              1
2         Bob    car                1              2              1
3       Alice    car                3              3              2
4     Charlie    car                1              4              1
5         Bob    car                2              5              2
6     Charlie  trunk                2              2              1